#include "esp_err.h"
#include "note_decode.h"
#include "esp_log.h"
#include "string.h"

/* ***************************************************************************************************************** */
/*                                               macro define                                                        */
/* ***************************************************************************************************************** */
#define TAG "NOTE_DECODE"
/* ***************************************************************************************************************** */
/*                                               struct define                                                       */
/* ***************************************************************************************************************** */

/* ***************************************************************************************************************** */
/*                                               global variable                                                     */
/* ***************************************************************************************************************** */
static const float g_midi_freq[128] = {
    8.18,    8.66,    9.18,    9.72,    10.3,    10.91,   11.56,   12.25,
    12.98,   13.75,   14.57,   15.43,   16.35,   17.32,   18.35,   19.45,
    20.6,    21.83,   23.12,   24.5,    25.96,   27.5,    29.14,   30.87,
    32.7,    34.65,   36.71,   38.89,   41.2,    43.65,   46.25,   49,
    51.91,   55,      58.27,   61.74,   65.41,   69.3,    73.42,   77.78,
    82.41,   87.31,   92.5,    98,      103.83,  110,     116.54,  123.47,
    130.81,  138.59,  146.83,  155.56,  164.81,  174.61,  185,     196,
    207.65,  220,     233.08,  246.94,  261.63,  277.18,  293.66,  311.13,
    329.63,  349.23,  369.99,  392,     415.3,   440,     466.16,  493.88,
    523.25,  554.37,  587.33,  622.25,  659.26,  698.46,  739.99,  783.99,
    830.61,  880,     932.33,  987.77,  1046.5,  1108.73, 1174.66, 1244.51,
    1318.51, 1396.91, 1479.98, 1567.98, 1661.22, 1760,    1864.66, 1975.53,
    2093,    2217.46, 2349.32, 2489.02, 2637.02, 2793.83, 2959.96, 3135.96,
    3322.44, 3520,    3729.31, 3951.07, 4186.01, 4434.92, 4698.64, 4978.03,
    5274.04, 5587.65, 5919.91, 6271.93, 6644.88, 7040,    7458.62, 7902.13,
    8372.02, 8869.84, 9397.27, 9956.06, 10548.08, 11175.3, 11839.82, 12543.85,
};


static const int g_scale_offset[10][7] = {
    {0, 2, 4, 5, 7, 9, 11}, // Major
    {0, 2, 3, 5, 7, 8, 10}, // Natual minor
    {0, 2, 3, 5, 7, 8, 11}, // Harmonic minor
    {0, 2, 3, 5, 7, 9, 11}, // Melodic minor
    {0, 2, 4, 5, 7, 9, 10}, // Dorian
    {0, 1, 3, 5, 7, 8, 10}, // Phrygian
    {0, 2, 4, 6, 7, 9, 11}, // Lydian
    {0, 2, 4, 5, 7, 9, 10}, // Mixolydian
    {0, 2, 3, 5, 7, 9, 10}, // Aeolian
    {0, 2, 4, 6, 7, 9, 11}, // Locrian
};

static int g_base = 48; // C3
static int g_scale = 0; // Major

/* ***************************************************************************************************************** */
/*                                           function prototype                                                      */
/* ***************************************************************************************************************** */



/**
 * @brief Parsing simple notation to midi number
 *
 * @param note  simple notation like "1", "2.", ".2", "#1", "b2", "1#", "1.b", "1.."
 * @return int  midi number
 */
int parse_simple_note_to_midi(const char *note)
{
    int dots_below = 0;
    int dots_above = 0;
    int note_num = 0;
    int accidentals = 0;  // 升降号计数器

    const char* p = note;

    // 解析下方点
    while (*p == '.') {
        dots_below++;
        p++;
    }

    // 解析数字前升降号
    while (*p == '#' || *p == 'b') {
        accidentals += (*p == '#') ? 1 : -1;
        p++;
    }

    // 解析音符数字
    note_num = *p - '0';
    p++;

    // 解析数字后升降号
    while (*p == '#' || *p == 'b') {
        accidentals += (*p == '#') ? 1 : -1;
        p++;
    }

    // 解析上方点
    while (*p == '.') {
        dots_above++;
        p++;
    }

    // 计算MIDI编号
    int octave_shift = dots_above - dots_below;
    int midi = g_base + g_scale_offset[g_scale][note_num - 1] + octave_shift * 12 + accidentals;;

    // 计算时值（示例：假设4分音符为480 ticks）
    // int duration = 480; // 默认四分音符

    return midi;
}

/**
 * @brief convert midi number to frequency
 *
 * @param midi
 * @return float
 */
float convert_midi_to_freq(int midi)
{
    return g_midi_freq[midi];
}

int set_base_and_scale(int base, int scale)
{
    if (base < 0 || base > 127) {
        return ESP_ERR_INVALID_ARG;
    }
    if (scale < 0 || scale > 9) {
        return ESP_ERR_INVALID_ARG;
    }
    g_base = base;
    g_scale = scale;
    ESP_LOGI(TAG, "Set base to %d, scale to %d", g_base, g_scale);

    return ESP_OK;
}
